CityDistanceCA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cit="http://j2ee.netbeans.org/wsdl/CityDistance/src/CityDistance">
  <soapenv:Body>
    <cit:GetCityDistance>
      <City1>Bruxelles</City1>
      <Country1>Belgium</Country1>
      <City2>Pisa</City2>
      <Country2>Italy</Country2>
      <LengthUnit>Kilometers</LengthUnit>
    </cit:GetCityDistance>
  </soapenv:Body>
</soapenv:Envelope>