CityDistanceCA/test/TestCase5/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cit="http://j2ee.netbeans.org/wsdl/CityDistance/src/CityDistance">
  <soapenv:Body>
    <cit:GetCityDistance>
      <City1>Madrid</City1>
      <Country1>Spain</Country1>
      <City2>Xyz</City2>
      <Country2>Unknown</Country2>
      <LengthUnit>Miles</LengthUnit>
    </cit:GetCityDistance>
  </soapenv:Body>
</soapenv:Envelope>